const locale =
{
  ru:
  {
    common:
    {
      viewAll: "Все",
      view: "Вид",
      filter: "Фильтр",
      currentPlaylist: "Текущий плейлист",
      clear: "Очистить",
      feedCaption:"Новости",
      notificationsCaption:"Уведомления",
      messagesCaption:"Сообщения",
      settingsCaption:"Настройки"
    },
    declension:
    {
      song: ["песня", "песни", "песен"],
      playlist: ["плейлист", "плейлиста", "плейлистов"],
      user: ["пользователь","пользователя", "пользователей"],
      play: ["прослушивание", "прослушивания", "прослушиваний"],
      like: ["лайк", "лайка", "лайков"],
      follower: ["подписчик", "подписчика", "подписчиков"],
      following: ["подписка", "подписки", "подписок"],
    },
    header:
    {
      nav: ["Главная", "Новости", "Библиотека", "Загрузить"],
      contextMenuOptions: ["Профиль", "Настройки", "Выйти"],
      searchPlaceholder: "Поиск"
    },
    userProfile:
    {
      nav: ["Все", "Популярное", "Песни", "Плейлисты", "Понравившееся"],
      popularOf: ["Популярные плейлисты", "Популярные песни"],
      songsOf: ["Песни"],
      playlistsOf: ["Плейлисты"],
      likesOf: ["Плейлисты, понравившиеся", "Песни, понравившиеся"],
    },
    userHeader:
    {
      followersOf:"Подписчики",
      followingOf:"Подписки"
    },
    you:
    {
      nav: ["Песни", "Плейлисты", "Подписки", "История"],
      yourSongs: "Слушайте свои и понравившиеся песни:",
      yourPlaylists: "Слушайте свои и понравившиеся плейлисты:",
      yourFollowing: "Послушайте, что опубликовали люди, на которых вы подписаны:",
      yourHistory: "Послушайте песни, которые вы слушали ранее:"
    },
    search:
    {
      nav: ["Песни", "Плейлисты", "Пользователи"]
    },
    selectOptions: ["Все", "Мои", "Понравившиеся"]
  }
}